Tekla.Structures.Model.IEvents
Interface for the Events class allows the user to register event listeners for Model events.
This interface allows the Marshaling of the Events class with Trimble.Remoting

Tekla.Structures.Model.IEvents.SelectionChange
The SelectionChange event is raised when the user changes the current selection inside Tekla Structures.

Tekla.Structures.Model.IEvents.CommandStatusChange
The CommandStatusChange event is raised when a command is started/ended.

Tekla.Structures.Model.IEvents.TrackEvent


Tekla.Structures.Model.IEvents.PointInputChanged


Tekla.Structures.Model.IEvents.ModelSave
The ModelSave event is raised just after a model has been saved.
[Obsolete("Deprecated. Please use OnModelSaveInfo instead.", false)]

Tekla.Structures.Model.IEvents.ModelSaveInfo
The ModelSave event is raised just after a model has been saved with the model save information as a string parameter.

Tekla.Structures.Model.IEvents.ModelSaveAs
The ModelSaveAs event is raised just after a model has been saved using save as.

Tekla.Structures.Model.IEvents.ModelLoad
The ModelLoad event is raised just after a model has been loaded.

Tekla.Structures.Model.IEvents.ModelLoadInfo
The ModelLoadInfo event is raised just after a model has been loaded with the model load information as a string parameter.

Tekla.Structures.Model.IEvents.ModelUnloading
The ModelUnloading event is raised just before the model is unloaded.

Tekla.Structures.Model.IEvents.Numbering
The Numbering event is raised just after a model has been numbered.

Tekla.Structures.Model.IEvents.ModelChanged
The ModelChanged event is raised just after some changes have been made to the model.
Note, this event is however not triggered when UNDO or REDO are performed.
[Obsolete("Use the new ModelObjectChanged event instead.")]

Tekla.Structures.Model.IEvents.ModelObjectNumbered
The ModelObjectNumbered event is raised when model object is numbered.

Tekla.Structures.Model.IEvents.ModelObjectChanged
The ModelObjectChanged event is raised just after some changes have been made to the model objects.
Note, this event is triggered when UNDO or REDO are performed!!

Tekla.Structures.Model.IEvents.TeklaStructuresExit
The TeklaStructuresExit event is raised just before Tekla Structures exits. After this event has been called
the user will no longer be able to perform any calls to Tekla Structures.

Tekla.Structures.Model.IEvents.ClashCheckDone
The ClashCheckDone event is raised just after clash check is completed.

Tekla.Structures.Model.IEvents.ClashDetected
The ClashDetected event is raised just after the detection of each clash.
The clash information is saved before the event is triggered.

Tekla.Structures.Model.IEvents.Interrupted
Occurs when user interrupts.

Tekla.Structures.Model.IEvents.ProjectInfoChanged
The ProjectInfoChanged event is raised just after some changes have been made to the project info.
Note, this event is however not triggered when UNDO or REDO are performed.

Tekla.Structures.Model.IEvents.ViewCameraChanged
Occurs when view camera is changed.

Tekla.Structures.Model.IEvents.ClipPlaneChanged
Occurs when clip plane is changed.

Tekla.Structures.Model.IEvents.ViewClosed
Occurs when view is closed.

Tekla.Structures.Model.IEvents.ViewOpened
Occurs when view is opened.

Tekla.Structures.Model.IEvents.ViewCreated
Occurs when view is created.

Tekla.Structures.Model.IEvents.ViewModified
Occurs when view is modified.

Tekla.Structures.Model.IEvents.ViewDeleted
Occurs when view is deleted.

Tekla.Structures.Model.IEvents.OnSelectionChange(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnAnnotationSelectionChange(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnCommandStatusChange(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnViewCameraChangedEvent(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnTrackEvent(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnPointInputChangedEvent(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnModelSave(System.String,System.Object[])
[Obsolete("Deprecated. Please use OnModelSaveInfo instead.", false)]

Tekla.Structures.Model.IEvents.OnModelSaveInfo(System.String,System.Object[])
Called when model is saved.
eventName: Name of the save event.
parameters: Event parameters. Contains the code which specifies the reason of the save action.

Tekla.Structures.Model.IEvents.OnModelSaveAs(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnModelLoad(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnModelLoadInfo(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnModelUnloading(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnModelUnloadingSync(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnNumbering(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnModelObjectNumbered(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnModelObjectChanged(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnDbCommit(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnTeklaStructuresExit(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnClashCheckDone(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnClashDetected(System.String,System.Object[])


Tekla.Structures.Model.IEvents.OnInterrupted
Called when user interrupts.

Tekla.Structures.Model.IEvents.OnUndoClicked
Called when user clicks undo.

Tekla.Structures.Model.IEvents.OnHiddenObjectsChanged
Called when objects are set to hidden or view is redrawn

Tekla.Structures.Model.IEvents.OnTemporaryStatesChanged
Called when the temporary states are changed.

Tekla.Structures.Model.IEvents.OnClipPlaneChanged(System.String,System.Object[])
Called when user inserts, updates or deletes a clip plane.

Tekla.Structures.Model.IEvents.OnClipBoxChanged(System.String,System.Object[])
Called when user inserts, updates or deletes a clip box.

Tekla.Structures.Model.IEvents.OnViewClosed(System.Int32)
Called when a view is closed.
viewId: The view id.

Tekla.Structures.Model.IEvents.OnViewOpened(System.Int32)
Called when a view is opened.
viewId: The view id.

Tekla.Structures.Model.IEvents.OnViewCreated(System.Int32)
Called when a view is created.
viewId: The view id.

Tekla.Structures.Model.IEvents.OnViewModified(System.Int32)
Called when a view is modified.
viewId: The view id.

Tekla.Structures.Model.IEvents.OnViewDeleted(System.Int32)
Called when a view is deleted.
viewId: The view id.

Tekla.Structures.Model.IEvents.OnModelViewDrawn(System.Int32)
Called when a view is drawn or redrawn.
viewId: The view id.

Tekla.Structures.Model.IEvents.OnTsEventOccurred(System.String)
Called when a TS event occurs.
eventInfo: The event info.

Tekla.Structures.Model.IEvents.OnProjectInfoChanged(System.String,System.Object[])


Tekla.Structures.Model.IEvents.Register
Registers the instance to listen to the specified events.
More event delegates should not be added without calling UnRegister
first.

Tekla.Structures.Model.IEvents.UnRegister
Unregisters the instance from listening to events.